# 문제
# N부터 M까지의 수들을 종이에 적었을 때 종이에 적힌 0들을 세는 프로그램을 작성하라.
# 예를 들어, N, M이 각각 0, 10일 때 0을 세면 0에 하나, 10에 하나가 있으므로 답은 2이다.
# 입력
# 첫 번째 줄에 테스트 케이스의 수 T가 주어진다.
# 각 줄에는 N과 M이 주어진다.
# 1 ≤ T ≤ 20
# 0 ≤ N ≤ M ≤ 1,000,000
# 출력
# 각각의 테스트 케이스마다 N부터 M까지의 0의 개수를 출력한다.

# 테스트 케이스 수 입력 받기
T = int(input())

for _ in range(T):
    N, M = map(int, input().split())

    zero_count = 0  # 0의 개수를 세기 위한 변수 초기화

    # N부터 M까지의 수를 반복
    for num in range(N, M + 1):
        # 현재 숫자를 문자열로 변환한 후, '0'의 개수를 세기
        zero_count += str(num).count('0')

    # 결과 출력
    print(zero_count, end="\n")